{
    "A": {
        "text": "The CTE Model Curriculum Standards and Framework for the __________________ Industry Sector are the basis for content of courses offered. Curriculum addresses \"Pathway\" standards within the program pathway(s) and course sequence.",
        "evidence": [
            "Course Outlines",
            "Course Catalog",
            "Local CTE Plan",
            "Review Curriculum"
        ]
    },
    "B": {
        "text": "Career paths have been identified and can be found on a chart or diagram in the CTE Plan.",
        "evidence": [
            "Local CTE Plan"
        ]
    },
    "C": {
        "text": "The CTE program has classroom-linked work-based learning and work experience education opportunities through strengthened industry partnerships, effective coordination with Regional Occupation Center/Program (ROC/P), adult schools, Work Experience Education, and Cooperative Work Experience Education programs, and a systematic review of policies and practices addressing barriers to access, including insurance, liability, and other issues.",
        "evidence": [
            "List of Work Based Learning (WBL) Sites",
            "Percentage of Students Participating"
        ]
    },
    "D": {
        "text": "The school master schedule allows students to follow the recommended sequence of CTE courses to complete the selected career path(s).",
        "evidence": [
            "Master Schedule",
            "Course Catalog"
        ]
    },
    "E": {
        "text": "Students are provided with a strong experience in and understanding of all aspects of industry.",
        "evidence": [
            "WBL Experiences",
            "Review Curriculum Document",
            "Lesson Plans"
        ]
    },
    "F": {
        "text": "Technology is incorporated into program instruction.",
        "evidence": [
            "Program-Based Software",
            "Program-Related Technology and Advanced Equipment"
        ]
    },
    "G": {
        "text": "There is collaboration between academic and CTE teachers.",
        "evidence": [
            "Agenda",
            "Minutes",
            "Sign-In Sheets"
        ]
    },
    "H": {
        "text": "CTE courses are industry certified, have been submitted to meet high school graduation requirements, University of California a-g (UC a-g) credit, or articulated with a community college.",
        "evidence": [
            "Copy of Certification or Licensure",
            "Copy of UC A-G Approval List; Articulation Agreements"
        ]
    },
    "length": 8,
    "id": "06c5643272b7161cdb5f81320cac1e98"
}
